{"0": {"sentence": "provide a set of functions to execute or a command-line interface on the system that hosts the Web server, function of web shells", "actual_id": "T1505.003", "predict_id": "T1505.003"}, "1": {"sentence": "Monitor network traffic for unusual ARP traffic, gratuitous ARP replies may be suspicious. Consider collecting changes to ARP caches across endpoints for signs of ARP poisoning", "actual_id": "T1558.004", "predict_id": "T1557.002"}, "2": {"sentence": "Incidents have been observed where adversaries have created backups of cloud instances and transferred them to separate accounts", "actual_id": "T1537", "predict_id": "T1537"}, "3": {"sentence": "If an adversary is using a standard command-line shell, analysts can detect token manipulation by auditing command-line activity.", "actual_id": NaN, "predict_id": "T1134.003"}, "4": {"sentence": "disabling individual services of high importance to an organization, such as MSExchangeIS, thus making exchange content inaccesible.", "actual_id": "T1489", "predict_id": "T1489"}, "5": {"sentence": " hide a program's true filetype by changing the extension of a file and later use this feature to trick users into double clicking benign-looking files of any format and ultimately executing something malicious", "actual_id": "T1036.006", "predict_id": "T1036.006"}, "6": {"sentence": "The malware basically provides a remote CMD/PowerShell terminal for the attackers, enabling them to execute any scripts/commands and receive the result via HTTP requests", "actual_id": "T1059", "predict_id": "T1059"}, "7": {"sentence": "Trickbot uses this encrypted module to scan the network and steal relevant network information.", "actual_id": "T1061", "predict_id": "T1027"}, "8": {"sentence": "The removal of the com.apple.quarantine flag by a user instead of the operating system is a suspicious action and should be examined further.", "actual_id": "T1553.001", "predict_id": "T1553.001"}, "9": {"sentence": "unusual login activity from unknown or abnormal locations, especially for privileged accounts", "actual_id": "T1114.002", "predict_id": "T1078.004"}, "10": {"sentence": "Changes to accessibility utility binaries or binary paths that do not correlate with known software, patch cycles, etc., are suspicious. Command line invocation of tools capable of modifying the Registry for associated keys are also suspicious. Utility arguments and the binaries themselves should be monitored for changes.", "actual_id": "T1531", "predict_id": "T1546.008"}, "11": {"sentence": "The malware sends an HTTP GET request to its C2 IP address using HTTP over port 443", "actual_id": "T1071", "predict_id": "T1071.001"}}